;  /////////////////
;  // Pharmacist //
;  ///////////////

[WOTC_KPP_Pharmacist X2SoldierClassTemplate]
DisplayName = "药剂师"
ClassSummary = "药剂师是维持我们士兵生命的专家。当他们不忙于治疗伤员时，他们会花时间对敌方部队施加衰弱效果。<br/><br/><font color='#CA7200'>使用无托式和兴奋剂枪。</font>"
+AbilityTreeTitles = "医生"
+AbilityTreeTitles = "助手"
+AbilityTreeTitles = "经销商"
+AbilityTreeTitles = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"

+RandomNickNames[0]="Doc"
+RandomNickNames[1]="Holiday"
+RandomNickNames[2]="Sticks"
+RandomNickNames[3]="Sawbones"
+RandomNickNames[4]="Pills"
+RandomNickNames[5]="Scrubs"
+RandomNickNames[6]="Slicer"
+RandomNickNames[7]="Tourney"
+RandomNickNames[8]="Quack"
+RandomNickNames[9]="Charlatan"
+RandomNickNames[10]="Pain"
+RandomNickNames[11]="Fee"
+RandomNickNames[12]="Hands"
+RandomNickNames[13]="Chaser"
+RandomNickNames[14]="Chops"
+RandomNickNames[15]="Emergency"
+RandomNickNames[16]="Skull"
+RandomNickNames[17]="Pusher"
+RandomNickNames[18]="Frankenstein"
+RandomNickNames[19]="Jekyll"
+RandomNickNames[20]="Hyde"
+RandomNickNames[21]="Butcher"
+RandomNickNames[22]="Front"
+RandomNickNames[23]="Psych"
+RandomNickNames[24]="Lab"
+RandomNickNames[25]="Beaker"
+RandomNickNames[26]="Dre"
+RandomNickNames[27]="Junkie"
+RandomNickNames[28]="Insurance"
+RandomNickNames[29]="Healbot"
+RandomNickNames[30]="Healer"
+RandomNickNames[31]="Patch"
+RandomNickNames_Male[0]="Bones"
+RandomNickNames_Male[1]="Needle"
+RandomNickNames_Male[2]="Mac"
+RandomNickNames_Male[3]="Medicine Man"
+RandomNickNames_Female[0]="Whitecoat"
+RandomNickNames_Female[1]="Heartbeat"
+RandomNickNames_Female[2]="Eyes"
+RandomNickNames_Female[3]="Lamb"
+RandomNickNames_Female[4]="Giggles"


; - GTS Unlocks -

[WOTC_KPP_PharmacistUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "药剂师：轻量兴奋剂"
Summary = "所有药剂师士兵的兴奋剂包熟练度现在将从2级开始，不受军衔影响。"

[WOTC_KPP_PharmacistUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "药剂师：加大剂量"
Summary = "所有药剂师士兵的兴奋剂包熟练度现在将从3级开始，不受军衔影响。<br/><br/><font color='#CA7200'>需要轻量兴奋剂</font>"

; - Ability Templates -

[WOTC_KPP_StimPouch X2AbilityTemplate]
LocFriendlyName = "兴奋剂包"
LocHelpText = " <Ability:ClassName/>获得提高对友军和敌军兴奋剂效果的特长，允许获得中毒堆叠的能力。"
LocLongDescription = " <Ability:ClassName/>获得提高对友军和敌军兴奋剂效果的特长，允许获得中毒堆叠的能力。"
LocPromotionPopupText = "<font color='#CA7200'>专注机制：</font> 每次你进入掩体时，都会积累中毒堆叠，使用非治疗性兴奋剂需要消耗中毒堆叠。中毒堆叠每提升一个熟练度等级增加1，起始为 <font color='#3ABD23'><Ability:POISON_STACK_MAX_I/></font>。 <br><font color='#CA7200'>等级 I</font> （在 <Ability:RANKNAME1/> 军衔[1]时获得）<br/><Bullet/> 获得恢复兴奋剂特长（使用你的兴奋剂手枪从远处治疗一个盟友，同时提供稳定兴奋剂）。<br/><Bullet/> 获得刺激特长（每回合一次，你可以移除附近盟友的心理障碍）<br/><Bullet/> 获得 <font color='#3ABD23'>+<Ability:PHARMACIST_MOBILITY/></font> 机动性。<br/><font color='#CA7200'>等级 II</font> （在 <Ability:RANKNAME3/> 军衔[3]时获得）<br/><Bullet/> 获得救星特长（治疗性兴奋剂额外恢复1点生命值）。<br/><Bullet/> 获得神经毒素特长（毒液兴奋剂使敌人迷失方向）。<br/><Bullet/> 获得 <font color='#3ABD23'>+<Ability:PHARMACIST_DODGE/></font> 闪避。<br/><font color='#CA7200'>等级 III</font> （在 <Ability:RANKNAME6/> 军衔[6]时获得）<br/><Bullet/> 获得针尖对麦芒特长（使用毒液兴奋剂射击敌人可造成基于兴奋剂枪等级的固定伤害）。<br/><Bullet/> 获得持久效果特长（治疗性兴奋剂在3回合内恢复 <font color='#3ABD23'><Ability:LINGERINGEFFECTS_MAX_HEALTH/></font> 生命值）。<br/><Bullet/> 获得 <font color='#3ABD23'>+<Ability:PHARMACIST_DEFENSE/></font> 防御。"

; Items

[StimGun_CV X2WeaponTemplate]
FriendlyName="兴奋剂枪"
FriendlyNamePlural="兴奋剂枪"
BriefSummary="兴奋剂枪是一种可以发射小针剂的装置。这些针剂可以充入恢复性化学物质或涂上致命毒药。"
TacticalText="<Bullet/> 使用兴奋剂需要消耗一个行动，但作为第一个行动使用时不会结束回合。\n<Bullet/> 通过适当的训练，恢复性和毒液兴奋剂的能力可以得到极大的提升。\n<Bullet/> 增加你治疗的点数： <Ability:RECOVERYSTIM_BONUS_HEAL_CV/> 。\n"
AbilityDescName="兴奋剂枪"

[StimGun_MG X2WeaponTemplate]
FriendlyName="兴奋剂爆破枪"
FriendlyNamePlural="兴奋剂爆破枪"
BriefSummary="兴奋剂爆破枪是兴奋剂枪的改进版本，能够装填更有效的化学混合物。"
TacticalText="<Bullet/> 使用兴奋剂需要消耗一个行动，但作为第一个行动使用时不会结束回合。\n<Bullet/> 通过适当的训练，恢复性和毒液兴奋剂的能力可以得到极大的提升。\n<Bullet/> 增加你治疗的点数： <Ability:RECOVERYSTIM_BONUS_HEAL_MG/> 。\n<Bullet/> 恢复兴奋剂和毒液兴奋剂额外获得一次使用次数。\n"
AbilityDescName="兴奋剂爆破枪"

[StimGun_BM X2WeaponTemplate]
FriendlyName="兴奋剂射线枪"
FriendlyNamePlural="兴奋剂射线枪"
BriefSummary="The 兴奋剂射线枪 is our most powerful support tool. It uses advanced beam technology to transmit its effects directly to the target."
TacticalText="<Bullet/> 使用兴奋剂需要消耗一个行动，但作为第一个行动使用时不会结束回合。\n<Bullet/> 通过适当的训练，恢复性和毒液兴奋剂的能力可以得到极大的提升。\n<Bullet/> 增加你治疗的点数： <Ability:RECOVERYSTIM_BONUS_HEAL_BM/> 。\n<Bullet/> 恢复兴奋剂和毒液兴奋剂额外获得两次使用次数。\n"
AbilityDescName="兴奋剂射线枪"

; Schematics

[StimGun_MG_Schematic X2SchematicTemplate]
m_strClassLabel="药剂师"
[StimGun_BM_Schematic X2SchematicTemplate]
m_strClassLabel="药剂师"

; Abilities

;<font color='#3ABD23'><Ability:_/></font>

[SG_RecoveryStim X2AbilityTemplate]
LocFriendlyName="恢复兴奋剂"
LocFlyOverText="恢复兴奋剂"
LocLongDescription="向一个盟友发射兴奋剂，以恢复生命值并移除燃烧、中毒和酸液效果。这种兴奋剂提供持续的治疗效果，以及一小部分即时生命值恢复。"
LocHelpText="向一个盟友发射兴奋剂，以恢复生命值并移除燃烧、中毒和酸液效果。这种兴奋剂提供持续的治疗效果，以及一小部分即时生命值恢复。"
LocPromotionPopupText="<Bullet/> 恢复兴奋剂有效地对一个远距离盟友应用医疗包治疗。<br/><Bullet/> 起始时有 <Ability:RECOVERYSTIM_BASE_CHARGES> 次使用次数，但每装备一个医疗包就会额外增加一次使用次数。<br/><Bullet/> 需要消耗一个行动，但不会结束使用者的回合。<br/><Bullet/> 你必须有视线对准目标，并且目标必须在正常武器范围内。<br/>"

[SG_RecoveryStim_Passive X2AbilityTemplate]
LocFriendlyName="恢复兴奋剂"
LocFlyOverText="恢复兴奋剂"
LocLongDescription="向一个盟友发射兴奋剂，以恢复生命值并移除燃烧、中毒和酸液效果。这种兴奋剂提供持续的治疗效果，以及一小部分即时生命值恢复。"
LocHelpText="向一个盟友发射兴奋剂，以恢复生命值并移除燃烧、中毒和酸液效果。这种兴奋剂提供持续的治疗效果，以及一小部分即时生命值恢复。"
LocPromotionPopupText="<Bullet/> 恢复兴奋剂有效地对一个远距离盟友应用医疗包治疗。<br/><Bullet/> 起始时有 <Ability:RECOVERYSTIM_BASE_CHARGES> 次使用次数，但每装备一个医疗包就会额外增加一次使用次数。<br/><Bullet/> 需要消耗一个行动，但不会结束使用者的回合。<br/><Bullet/> 你必须有视线对准目标，并且目标必须在正常武器范围内。<br/>"

[SG_VenomStim X2AbilityTemplate]
LocFriendlyName="毒液兴奋剂"
LocFlyOverText="毒液兴奋剂"
LocLongDescription="向一个敌人发射兴奋剂，不会造成伤害，但会施加中毒效果。这种攻击不会miss，并且消耗 <font color='#3ABD23'><Ability:VENOM_STIM_COST/></font> 个中毒堆叠。"
LocHelpText="向一个敌人发射兴奋剂，不会造成伤害，但会施加中毒效果。这种攻击不会miss，并且消耗 <font color='#3ABD23'><Ability:VENOM_STIM_COST/></font> 个中毒堆叠。"
LocPromotionPopupText="<Bullet/> 毒液兴奋剂不能用于对毒药免疫的目标。<br/><Bullet/> 起始时有 <Ability:VENOMSTIM_BASE_CHARGES> 次使用次数，但每装备一个医疗包就会额外增加一次使用次数。<br/><Bullet/> 需要消耗一个行动，但不会结束使用者的回合。<br/><Bullet/> 你必须有视线对准目标，并且目标必须在正常武器范围内。<br/>"

[SG_VenomStim_Passive X2AbilityTemplate]
LocFriendlyName="毒液兴奋剂"
LocFlyOverText="毒液兴奋剂"
LocLongDescription="Fire a stim at an enemy that deals no damage, but applies poison. This attack cannot miss."
LocHelpText="Fire a stim at an enemy that deals no damage, but applies poison. This attack cannot miss."
LocPromotionPopupText="<Bullet/> 毒液兴奋剂不能用于对毒药免疫的目标。<br/><Bullet/> 起始时有 <Ability:VENOMSTIM_BASE_CHARGES> 次使用次数，但每装备一个医疗包就会额外增加一次使用次数。<br/><Bullet/> 需要消耗一个行动，但不会结束使用者的回合。<br/><Bullet/> 你必须有视线对准目标，并且目标必须在正常武器范围内。<br/>"

[SG_PinsAndNeedles X2AbilityTemplate]
LocFriendlyName="针尖对麦芒"
LocFlyOverText="针尖对麦芒"
LocLongDescription="你的毒液兴奋剂现在会对目标造成一定量的固定伤害。"
LocHelpText="你的毒液兴奋剂现在会对目标造成一定量的固定伤害。"
LocPromotionPopupText="<Bullet/> 毒液兴奋剂仍然只能用于对毒药脆弱的目标。<br/><Bullet/> 更高级的兴奋剂枪会造成更多伤害。<br/>"

[SG_Neurotoxin X2AbilityTemplate]
LocFriendlyName="神经毒素"
LocFlyOverText="神经毒素"
LocLongDescription="毒液兴奋剂现在也会使目标迷失方向。"
LocHelpText="毒液兴奋剂现在也会使目标迷失方向。"
LocPromotionPopupText="<Bullet/> 毒液兴奋剂仍然只能用于对毒药脆弱的目标。<br/>"

[SG_LingeringEffects X2AbilityTemplate]
LocFriendlyName="持久效果"
LocFlyOverText="持久效果"
LocLongDescription="恢复兴奋剂现在会在几回合内为盟友提供持续的生命值再生。"
LocHelpText="恢复兴奋剂现在会在几回合内为盟友提供持续的生命值再生。"
LocPromotionPopupText="<Bullet/> 这个能力将在每回合开始时恢复 <Ability:LINGERINGEFFECTS_HEAL_PER_TURN> 生命值，最多恢复到 <Ability:LINGERINGEFFECTS_MAX_HEALTH>。<br/><Bullet/> 再生效果只能在每个任务中为每个盟友提供一次。<br/>"

[SG_OverTheCounter X2AbilityTemplate]
LocFriendlyName="非处方药"
LocFlyOverText="非处方药"
LocLongDescription="增加 <Ability:OVERTHECOUNTER_BONUS_RECOVERY_STIMS> 次额外的恢复兴奋剂使用次数。"
LocHelpText="增加 <Ability:OVERTHECOUNTER_BONUS_RECOVERY_STIMS> 次额外的恢复兴奋剂使用次数。"
LocPromotionPopupText="<Bullet/> 增加 <Ability:OVERTHECOUNTER_BONUS_RECOVERY_STIMS> 次额外的恢复兴奋剂使用次数。<br/>"

[SG_UnderTheTable X2AbilityTemplate]
LocFriendlyName="桌下交易"
LocFlyOverText="桌下交易"
LocLongDescription="增加 <Ability:UNDERTHECOUNTER_BONUS_VENOM_STIMS> 次额外的毒液兴奋剂使用次数。"
LocHelpText="增加 <Ability:UNDERTHECOUNTER_BONUS_VENOM_STIMS> 次额外的毒液兴奋剂使用次数。"
LocPromotionPopupText="<Bullet/> 增加 <Ability:UNDERTHECOUNTER_BONUS_VENOM_STIMS> 次额外的毒液兴奋剂使用次数。<br/>"

[SG_CombatClinic X2AbilityTemplate]
LocFriendlyName="战斗诊所"
LocFlyOverText="战斗诊所"
LocLongDescription="向所有你能看到的盟友（包括你自己）发射恢复兴奋剂。"
LocHelpText="向所有你能看到的盟友（包括你自己）发射恢复兴奋剂。"
LocPromotionPopupText="<Bullet/> 每个任务一次充能。<br/><Bullet/> 持久效果和救星特性的加成也适用于战斗诊所。<br/>"

[SG_QuickStim X2AbilityTemplate]
LocFriendlyName="快速刺激"
LocFlyOverText="快速刺激"
LocLongDescription="激活这个能力，使你本回合的下一个兴奋剂枪能力不需要消耗行动点。"
LocHelpText="激活这个能力，使你本回合的下一个兴奋剂枪能力不需要消耗行动点。"
LocPromotionPopupText="<Bullet/>  冷却时间：<Ability:QUICKSTIM_COOLDOWN> 回合。<br/><Bullet/> 适用于恢复兴奋剂、毒液兴奋剂、战斗诊所和毒雾。<br/>"

[SG_ToxicCloud X2AbilityTemplate]
LocFriendlyName="毒雾"
LocFlyOverText="毒雾"
LocLongDescription="发射一种特殊的兴奋剂，这种兴奋剂对目标的作用类似于正常的毒液兴奋剂，并在他们周围释放大量毒雾，消耗 <font color='#3ABD23'><Ability:TOXIC_STIM_COST/></font> 个中毒堆叠。"
LocHelpText="发射一种特殊的兴奋剂，这种兴奋剂对目标的作用类似于正常的毒液兴奋剂，并在他们周围释放大量毒雾，消耗 <font color='#3ABD23'><Ability:TOXIC_STIM_COST/></font> 个中毒堆叠。"
LocPromotionPopupText="<Bullet/> 每个任务一次充能。<br/><Bullet/> 针尖对麦芒和神经毒素的加成也适用于主要目标和效果范围内的目标。<br/>"

[SG_IncreasedDosage X2AbilityTemplate]
LocFriendlyName="加大剂量"
LocFlyOverText="加大剂量"
LocLongDescription="你施加的毒药现在会造成更多的持续伤害。"
LocHelpText="你施加的毒药现在会造成更多的持续伤害。"
LocPromotionPopupText="<Bullet/> 增加毒药持续伤害 <Ability:INCREASEDDOSAGE_DOT_BONUS>。<br/><Bullet/> 适用于你造成的所有形式的毒药，包括来自毒液兴奋剂和气罐的毒药。<br/>"

[SG_NitroStim X2AbilityTemplate]
LocFriendlyName="硝化兴奋剂"
LocFlyOverText="硝化兴奋剂"
LocLongDescription="向一个盟友发射兴奋剂，增加他们 +<Ability:NITROSTIM_CRIT_BONUS/> 的暴击几率，增加 +<Ability:NITROSTIM_MOBILITY_BONUS/> 点机动性，持续 <Ability:NITROSTIM_DURATION/> 回合。"
LocHelpText="向一个盟友发射兴奋剂，增加他们 +<Ability:NITROSTIM_CRIT_BONUS/> 的暴击几率，增加 +<Ability:NITROSTIM_MOBILITY_BONUS/> 点机动性，持续 <Ability:NITROSTIM_DURATION/> 回合。"
LocPromotionPopupText="<Bullet/> 多次使用能力不会叠加。<br/><Bullet/> 需要消耗一个行动，但不会结束使用者的回合。<br/><Bullet/> 你必须有视线对准目标，并且目标必须在正常武器范围内。<br/>"

[SG_FocusStim X2AbilityTemplate]
LocFriendlyName="专注兴奋剂"
LocFlyOverText="专注兴奋剂"
LocLongDescription="向一个盟友发射兴奋剂，增加他们 +<Ability:FOCUSSTIM_AIM_BONUS/> 点瞄准，持续 <Ability:FOCUSSTIM_DURATION/> 回合。"
LocHelpText="向一个盟友发射兴奋剂，增加他们 +<Ability:FOCUSSTIM_AIM_BONUS/> 点瞄准，持续 <Ability:FOCUSSTIM_DURATION/> 回合。"
LocPromotionPopupText="<Bullet/> 多次使用能力不会叠加。<br/><Bullet/> 需要消耗一个行动，但不会结束使用者的回合。<br/><Bullet/> 你必须有视线对准目标，并且目标必须在正常武器范围内。<br/>"

[SG_StabilizeStim X2AbilityTemplate]
LocFriendlyName="稳定兴奋剂"
LocFlyOverText="稳定兴奋剂"
LocLongDescription="通过远程射击一个针剂来阻止士兵流血至死。消耗一个充能（与恢复兴奋剂共享）。"
LocHelpText="通过远程射击一个针剂来阻止士兵流血至死。"

[SG_Savior X2AbilityTemplate]
LocFriendlyName="救星"
LocFlyOverText="救星"
LocLongDescription="治疗能力恢复 <Ability:SAVIOR_BONUS_HEAL_AMMOUNT> 点额外生命值。"
LocHelpText="治疗能力恢复 <Ability:SAVIOR_BONUS_HEAL_AMMOUNT> 点额外生命值。"
LocPromotionPopupText="<Bullet/> 效果适用于GREMLIN治疗、医疗包、恢复兴奋剂和恢复能力。<br/>"

[WOTC_KPP_VenomSting X2AbilityTemplate]
LocFriendlyName = "毒液刺击"
LocHelpText = "向所有可中毒的目标发射毒液兴奋剂，消耗 <font color='#3ABD23'><Ability:STING_STIM_COST/></font> 个中毒堆叠。."
LocLongDescription = "向所有可中毒的目标发射毒液兴奋剂，消耗 <font color='#3ABD23'><Ability:STING_STIM_COST/></font> 个中毒堆叠。."
LocPromotionPopupText = "向所有可中毒的目标发射毒液兴奋剂，通过针尖对麦芒、加大剂量和快速刺激进行改进，消耗 <font color='#3ABD23'><Ability:STING_STIM_COST/></font> 个中毒堆叠。."

[WOTC_KPP_ReactiveSting X2AbilityTemplate]
LocFriendlyName = "反应性刺击"
LocHelpText = "向在 <font color='#3ABD23'><Ability:REACTIVE_STING_TILE_RANGE/></font> 格内的目标发射毒液兴奋剂，带有针尖对麦芒效果时造成双倍伤害，每回合只能对 <font color='#3ABD23'><Ability:REACTIVE_STING_PER_TARGET_COOLDOWN/></font> 个目标使用一次，消耗 <font color='#3ABD23'><Ability:REACTIVE_STIM_COST/></font> 个中毒堆叠。"
LocLongDescription = "向在 <font color='#3ABD23'><Ability:REACTIVE_STING_TILE_RANGE/></font> 格内的目标发射毒液兴奋剂，带有针尖对麦芒效果时造成双倍伤害，每回合只能对 <font color='#3ABD23'><Ability:REACTIVE_STING_PER_TARGET_COOLDOWN/></font> 个目标使用一次，消耗 <font color='#3ABD23'><Ability:REACTIVE_STIM_COST/></font> 个中毒堆叠。"
LocPromotionPopupText = "向在 <font color='#3ABD23'><Ability:REACTIVE_STING_TILE_RANGE/></font> 格内的目标发射毒液兴奋剂，每回合只能对 <font color='#3ABD23'><Ability:REACTIVE_STING_PER_TARGET_COOLDOWN/></font> 个目标使用一次，针尖对麦芒效果使反应性刺击造成更多伤害，消耗 <font color='#3ABD23'><Ability:REACTIVE_STIM_COST/></font> 个中毒堆叠。"